EmDonato/unicycle/Robot_mobile.cydsn/Generated_Source/PSoC6/I2C_Display.h
/*******************************************************************************
* Function Name: I2C_Display_SlaveClearWriteStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearWriteStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_Display_SlaveClearWriteStatus(void)
{
    return Cy_SCB_I2C_SlaveClearWriteStatus(I2C_Display_HW, &I2C_Display_context);
}
#endif /* (I2C_Display_ENABLE_SLAVE) */


#if (I2C_Display_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_Display_MasterGetStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterGetStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_Display_MasterGetStatus(void)
{
    return Cy_SCB_I2C_MasterGetStatus(I2C_Display_HW, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterRead() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterRead(cy_stc_scb_i2c_master_xfer_config_t *xferConfig)
{
    return Cy_SCB_I2C_MasterRead(I2C_Display_HW, xferConfig, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterAbortRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterAbortRead() PDL driver function.
*
******************************************************************************/
__STATIC_INLINE void I2C_Display_MasterAbortRead(void)
{
    Cy_SCB_I2C_MasterAbortRead(I2C_Display_HW, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterWrite(cy_stc_scb_i2c_master_xfer_config_t *xferConfig)
{
    return Cy_SCB_I2C_MasterWrite(I2C_Display_HW, xferConfig, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterAbortWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterAbortWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_Display_MasterAbortWrite(void)
{
    Cy_SCB_I2C_MasterAbortWrite(I2C_Display_HW, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterGetTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterGetTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_Display_MasterGetTransferCount(void)
{
    return Cy_SCB_I2C_MasterGetTransferCount(I2C_Display_HW, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterSendStart
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSendStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterSendStart(uint32_t address, cy_en_scb_i2c_direction_t bitRnW, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterSendStart(I2C_Display_HW, address, bitRnW, timeoutMs, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterSendReStart
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSendReStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterSendReStart(uint32_t address, cy_en_scb_i2c_direction_t bitRnW, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterSendReStart(I2C_Display_HW, address, bitRnW, timeoutMs, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterSendStop
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSendStop() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterSendStop(uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterSendStop(I2C_Display_HW, timeoutMs, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterReadByte
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterReadByte() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterReadByte(cy_en_scb_i2c_command_t ackNack, uint8_t *byte, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterReadByte(I2C_Display_HW, ackNack, byte, timeoutMs, &I2C_Display_context);
}


/*******************************************************************************
* Function Name: I2C_Display_MasterWriteByte
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterWriteByte() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_Display_MasterWriteByte(uint8_t byte, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterWriteByte(I2C_Display_HW, byte, timeoutMs, &I2C_Display_context);
}
#endif /* (I2C_Display_ENABLE_MASTER) */


/*******************************************************************************
* Function Name: I2C_Display_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_Display_Interrupt(void)
{
    Cy_SCB_I2C_Interrupt(I2C_Display_HW, &I2C_Display_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* I2C_Display_CY_SCB_I2C_PDL_H */


/* [] END OF FILE */
